tap "ariga/tap"
tap "danvergara/tools"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "jorgerojas26/lazysql"
tap "kortin99/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sqldef/sqldef"
tap "steipete/tap"

brew "openssl@3"
brew "openssl@1.1"
brew "awscli"
brew "bash"
brew "bat"
brew "bottom"
brew "btop"
brew "bzip2"
brew "c-ares"
brew "curl"
brew "dbmate"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "gdu"
brew "gemini-cli"
brew "gettext"
brew "gh"
brew "git"
brew "git-delta"
brew "grpcurl"
brew "imagemagick"
brew "kubectx"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "libevent"
brew "libgit2"
brew "libssh2"
brew "luajit"
brew "luarocks"
brew "luv"
brew "make"
brew "mise"
brew "mysql"
brew "neovim"
brew "openldap"
brew "pipx"
brew "pngpaste"
brew "postgresql@14"
brew "protobuf"
brew "qemu"
brew "redis"
brew "ripgrep"
brew "rtmpdump"
brew "serverless"
brew "tcl-tk"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tmux"
brew "uv"
brew "vivid"
brew "zbar"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "danvergara/tools/dblab"
brew "jorgerojas26/lazysql/lazysql"
brew "kortin99/tap/fzf-tab"
brew "qmk/qmk/qmk"
brew "sqldef/sqldef/mysqldef"

cask "arc"
cask "claude"
cask "claude-code"
cask "codex"
cask "karabiner-elements"
cask "obsidian"
cask "qmk-toolbox"
cask "raycast"
cask "scroll-reverser"
cask "session-manager-plugin"
cask "wezterm"
cask "zap"

go "cmd/go"
go "cmd/gofmt"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/sanposhiho/gomockhandler"
go "golang.org/x/tools/gopls"
go "github.com/vburenin/ifacemaker"
go "go.uber.org/mock/mockgen"
go "github.com/rubenv/sql-migrate/sql-migrate"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/google/wire/cmd/wire"

cargo "cargo-binutils"
cargo "cargo-compete"
cargo "cargo-snippet"
cargo "git-delta"
cargo "tree-sitter-cli"
