tap "ariga/tap"
tap "danvergara/tools"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "jorgerojas26/lazysql"
tap "kortin99/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sqldef/sqldef"
tap "steipete/tap"

brew "bash"
brew "bzip2"
brew "c-ares"
brew "curl"
brew "docker"
brew "docker-compose"
brew "gemini-cli"
brew "gettext"
brew "libevent"
brew "libgit2"
brew "libssh2"
brew "luajit"
brew "luarocks"
brew "luv"
brew "make"
brew "openldap"
brew "openssl@3"
brew "pipx"
brew "qemu"
brew "rtmpdump"
brew "serverless"
brew "tcl-tk"
brew "zlib"
brew "danvergara/tools/dblab"
brew "kortin99/tap/fzf-tab"
brew "qmk/qmk/qmk"
brew "sqldef/sqldef/mysqldef"

cask "arc"
cask "karabiner-elements"
cask "wezterm"
cask "claude"
cask "claude-code"
cask "codex"
cask "obsidian"
cask "qmk-toolbox"
cask "raycast"
cask "scroll-reverser"
cask "session-manager-plugin"
cask "zap"

go "cmd/go"
go "cmd/gofmt"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/sanposhiho/gomockhandler"
go "golang.org/x/tools/gopls"
go "github.com/vburenin/ifacemaker"
go "go.uber.org/mock/mockgen"
go "github.com/rubenv/sql-migrate/sql-migrate"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/google/wire/cmd/wire"

cargo "cargo-binutils"
cargo "cargo-compete"
cargo "cargo-snippet"
cargo "tree-sitter-cli"
