tap "danvergara/tools"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
brew "asdf"
brew "bottom"
brew "bzip2"
brew "eza"
brew "libssh2"
brew "openldap"
brew "rtmpdump"
brew "curl"
brew "fd"
brew "fzf"
brew "gdu"
brew "gh"
brew "git"
brew "grpcurl"
brew "kubectx"
brew "libevent"
brew "luajit"
brew "luarocks"
brew "luv"
brew "mise"
brew "neovim"
brew "openssl@1.1"
brew "pngpaste"
brew "protobuf"
brew "redis"
brew "ripgrep"
brew "sbt"
brew "tcl-tk"
brew "the_silver_searcher"
brew "tmux"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "jesseduffield/lazygit/lazygit"
cask "wezterm"

